# Задача 2. Напишите программу вычисления арифметического выражения заданного строкой.
#  Используйте операции +,-,/,*. приоритет операций стандартный.а) Решите задачу для одного действия;

example = '1+2+4*3-6'
print(example, '=', eval(example))
