# Задача 2. Напишите программу вычисления арифметического выражения заданного строкой.
#  Используйте операции +,-,/,*. приоритет операций стандартный.а) Решите задачу для одного действия;

example = input()
print(example, '=', eval(example))
